Tekla.Structures.Model.GeneralConnectiveGeometryException
The GeneralConnectiveGeometryException class represents a general error that occurred during the ConnectiveGeometry creation or modification.

Tekla.Structures.Model.GeneralConnectiveGeometryException.#ctor
Initializes a new instance of the GeneralConnectiveGeometryException class with "Failed to create or modify connective geometry" message.